
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьРоли();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ЗаполнитьРоли();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТолькоРолиТМСПриИзменении(Элемент)
	ЗаполнитьРоли();
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ЗаполнитьРоли();
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	ТабличныйДокумент = СформироватьНаСервере();
	ТабличныйДокумент.Показать();
	ТабличныйДокумент.ФиксацияСверху	= 1;
	ТабличныйДокумент.ФиксацияСлева		= 3;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлаги(Команда)
	
	Для каждого Строка Из Объект.Роли Цикл
		Строка.Флаг = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлаги(Команда)
	
	Для каждого Строка Из Объект.Роли Цикл
		Строка.Флаг = Ложь;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ЗаполнитьРоли()
	текОбъект = РеквизитФормыВЗначение("Объект");
	текОбъект.ЗаполнитьРоли();
	ЗначениеВРеквизитФормы(текОбъект, "Объект");
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
	
	текОбъект = РеквизитФормыВЗначение("Объект");
	Возврат текОбъект.СформироватьОтчет();
	
КонецФункции
 
#КонецОбласти

	




	



	

